[[{"summary":"","title":"Registration + breakfast snacks","speakers":[],"time":"09:00","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"","title":"Conference Opening","speakers":[],"time":"10:00","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"","title":"Welcome Keynote","speakers":[],"time":"10:30","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"","title":"Break","speakers":[],"time":"11:15","durationInMinutes":45,"room":"Room 1","isBreak":true},{"summary":"In our daily work we get to see a lot of projects and answer many typical questions about Flow and Neos. The most prevalent of those problems will be discussed in this talk. THis will be rather technical and go into some detail while explaining concepts and challenges many people encounter working with Flow and Neos.\n\nIf your code is versioned, you know all the different meanings of \"Context\", work with composer on a daily basis and eat FlowQuery for breakfast you might already know everything, but if not, then listen in.","title":"The F-Files - Insights from 3 years of Neos Support","speakers":[{"name":"Christian Müller","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/0045304204160e3f3b75dcb1336ce7ee5655a24c/christian-mueller_300px.jpg","twitter":"daskitsunet","company":"Flownative GmbH","summary":"Christian Müller is co-founder of Flownative, which provides development support, quality assurance, consulting and coaching to Neos and Flow agencies and users. In his free time he picks up the Cello or switches the computer keyboard for a piano keyboard."}],"time":"11:45","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"No more waste: no offers, no specs, no contracts and your projects will be better, faster, cheaper. Forget old school and waterfall: Do projects the most efficient way you can imagine. During the agile transition of its company, sitegeist combined L.ean and A.gile components with R.aw E.stimates. Without knowing, they created a disruptive new agency concept. Get the main idea of „#RawEstimates“ and „The RE.A.L.-Concept“ with practical examples, take a look on how to establish and control it. At first sitegeist was asked proactively to coach and consult a radical “agilisation” by various internet- and marketing agencies. Meanwhile sitegeist advises other international consultants and production-businesses on becoming agile. It can be a real game-changer for your agency.\n\nMore Information: real.sitegeist.rocks","title":"Do the RE.A.L Thing: No-Waste-Projects","speakers":[{"name":"Sven Ditz","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/67f2dc4f8b03d68117eafb8fdea53fddc9611081/SDI_Speaker_sw_TIC-318x397.jpg","twitter":"gehtdoch","company":"sitegeist","summary":"Sven is an internet professional since 1996. He is founder and CEO of the agency sitegeist in Hamburg. He has been speaker and keynote-speaker for countless national and international events like the worlds biggest tourism fair „ITB“, the Travel Industry Club, BITKOM, TYPO3 Conference or AgenturCamp."}],"time":"11:45","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"The new user interface of the Neos CMS is not merely a rewrite of the old functionality, but being based on ReactJS it unveils an exciting topic of extensibility which goes way beyond what has been possible with the old UI. In this talk we will demonstrate all of the basic points of planned extensibility, but won't stop there and show  how it is possible to build completely custom-tailored interfaces for your projects without spending NASA-like budgets.","title":"Neos UI Extensibility and Beyond","speakers":[{"name":"Dmitri Pisarev","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/85e55f9b560b7d1ae949e24876a797f675990d22/Dimitri-Pisarev_300px.jpg","twitter":"dimaip","company":"Saint Philaret’s Christian Orthodox Institute (SFI)","summary":"Dmitri is a Christian believer. Also he is a lead web developer working in St Philaret Christian University located in Moscow. He fell in love with the Neos project at first sight and has joined the development team shortly after."},{"name":"Max Strübing","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/44302524d28b29f507cfacec622103d1e6bf9571/MaxStruebing-663x828-545x681.jpg","twitter":"mxstrbng","company":"sitegeist","summary":"Max is a full-stack-developer at sitegeist media solutions GmbH in Hamburg. He fell in love with Neos since his first touching points two years ago. Since 2016 he is contributing to the new React UI actively and joined the core team in July 2017. When he is not coding he likes to read and play guitar."}],"time":"12:35","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"In this talk, you will see why it is fantastic to publish packages. We'll explain, which are the challenges, and why it is important to publish your code for Neos. Also, some tips and tricks will be delivered: How it create an easy-to-install but yet powerful to customize and expandable package. In the end, you will be encouraged to create and maintain your own packages.","title":"Why creating Open Source packages help you to become a better developer","speakers":[{"name":"Jon Uhlmann","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/2f464002ea405ebeeba6642ccb9cda9babd181f3/Jon%20Uhlmann-875x1094-545x681.jpg","twitter":"Jonnitto","company":"gesagt. getan.","summary":"Jon Uhlmann is one of the web workers at gesagt.getan. based in Salzburg, Austria. He not only loves it to write clean code, but he is also very enthusiastic about trying the newest technologies and improving the workflow."}],"time":"12:35","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"","title":"Lunch","speakers":[],"time":"13:20","durationInMinutes":45,"room":"Room 1","isBreak":true},{"summary":"There are many ways to start a new Neos-based project and there is a multitude of tools involved. This session will introduce a \"perfect\" way to set up a Neos project. It covers the versioning in Git, offering a setup that allows to manage multiple packages in one repository without affecting how dependencies are managed with composer. A way to and maintain a consistent local development environment to minimize ramp-up time and allow developers to quickly get started with a project will be shown.  Deployment and hosting strategies along with suggestions to use configuration contexts to keep settings organized and conflict-free will  close the session.","title":"The perfect Neos project setup","speakers":[{"name":"Karsten Dambekalns","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/ff4bb6daa3786ee7733006bbdf1078594984b420/KarstenD-800x960-545x654.jpg","twitter":"kdambekalns","company":"Flownative","summary":"Karsten is part of the development of Flow and Neos since 2007. He considers himself a Creative Code Engineer: Developing software is–if done right–engineering, but as with most things in live, creativity gets you a long way. He is co-founder of Flownative, which provides development support, quality assurance, consulting and coaching to Neos and Flow agencies and users."}],"time":"14:30","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"This talk explains the principles of every system that is exposed to variability and unpredictability. Such as software development. Learn why it is not capacity planning that will save your day, what traffic and stock markets can tell you about your organization, what is the key benefit of agile practices and how you might be wasting your company’s potential. Find out the correct economics to base your decisions on. Change your system - not your people.","title":"Buried in queues","speakers":[{"name":"Stefan Regniet","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/6eca3e42dd47c3459b7b8606abb2d3f82e71f4c3/stefanregniet-400x500.jpg","company":"TechDivision GmbH","summary":"Stefan is Head of CMS Development @TechDivision. He has been working with Flow and Neos from the very beginning but besides from technology he also works as an agile coach. As Certified Scrum Professional he fosters teams to grow beyond technical quality. \nStefan lives in Bad Aibling, Germany together with his wife, daughter and two dogs."}],"time":"14:30","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"","title":"Case Studies\n\n\t\t\t\n\t\t\t\tManage Neos and Flow in a Kubernetes cluster\n\t\t\t\t \n\t\t\t\tAll-in Digital Transformation of a Publishing House with Neos","speakers":[],"time":"15:20","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"","title":"Coffee Break","speakers":[],"time":"16:05","durationInMinutes":45,"room":"Room 1","isBreak":true},{"summary":"Sometimes, you open up a website and before anything else these buttons appear: “To the website” or “To the shop”. Why is this necessary? Most likely, because shopping solutions usually lack CMS-like editing powers and CMSes usually lack features like checkout, stock, orders and customer data. An integrated experience requires you to choose one system and add the missing features. Or is it possible to marry the best of both worlds? We will show the example of an integration between Shopware and Neos and our approach to problems like:\n\n\n\tHandling article data without redundancy\n\tSynchronizing the content cache with Shopware\n\tBridging the gap between the two rendering layers\n\tManaging routes between both systems\n\tAugmenting article data with custom content","title":"Building Content-driven Shopping Experiences with Neos & Shopware","speakers":[{"name":"Miriam Müller","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/da554d490f9e2137d163817833fef8ca5009a446/IMG_0182-400x500.jpg","company":"sitegeist","summary":"Miriam works as a Senior PHP-developer at sitegeist. After her academic studies she started working with Java and the CMS OpenCMS before she specialized on PHP and eCommerce. For six years she focused on Magento and now for four years she is dedicated to the shopsystem Shopware. Miriam has a significant role in the development of a bridge between Shopware and Neos.\n\nIn her free time she is engaged in game development for smartphones and tablets and plays in a badminton team. Also she passionately follows the german soccer Bundesliga and likes to go to concerts and music festivals."},{"name":"Martin Ficzel","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/8ff227766631242daddfd5d96c84db4b55b3fc24/Martin-Ficzel_300px.jpg","twitter":"kopfaufholz","company":"sitegeist","summary":"Martin is a backend developer at sitegeist neos solutions GmbH in Hamburg. \nSince three years he focused his work almost exclusively on Neos and Flow and is still happy with this decision. In 2016 he joined the Neos CMS Core Team where he is working to extend the possibilities of the Neos-Fusion rendering layer. Martin lives in Hamburg with two kids and his girlfriend. Besides work he likes nature and climbing."}],"time":"16:30","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"Open Source Software is ubiquitous in web agencies today. Yet agencies miss out on vital opportunities when they merely use Open Source Software instead of tapping into the potential of its community.\n\nBut apart from the not existing license costs, agencies can gain much greater benefits by being active members of Open Source communities: for example increased employee motivation, brand awareness and of course economic benefits. In this talk I explore these benefits in detail and also examine some common reservations against Open Source like bad support, unclear liability or continuity of development.","title":"How agencies profit from Open Source","speakers":[{"name":"Tobias Gruber","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/3ab4ab6a4e6583cc7182cb751ece2af737639e68/Tobias_Gruber_300px.jpg","twitter":"sandstorm_tobi","company":"Sandstorm","summary":"Tobias is a non-coder feeling at home with digital innovation and business strategy. He joined the Neos team in 2015 focussing on communication and internal organisation. Tobias is one of the co-founders of Sandstorm, which is specialised in the development of demanding web applications. After a couple of years as an enterprise IT consultant for transformation and outsourcing he is now doing business development for Sandstorm. He lives in the beautiful city Dresden with his wife and two daughters."}],"time":"16:30","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"","title":"Neos Award + Closing Day 1","speakers":[],"time":"17:20","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"","title":"Social Event - Drinks & Dancing","speakers":[],"time":"20:00","durationInMinutes":45,"room":"Room 1","isBreak":false}],[{"summary":"","title":"Arrival & Breakfast","speakers":[],"time":"09:00","durationInMinutes":45,"room":"Room 1","isBreak":true},{"summary":"We are currently busy reworking the central data store of Neos: The content repository (CR), is currently getting a from-scratch rewrite. We'll quickly showcase the evolution of the current-generation CR, and explain which of our design decisions worked out and where we currently see the biggest problems.\n\nAfter that, we'll explain why we're settling on an event-sourced architecture, then showing the current status of the rewrite. We'll be demonstrating how integrators will work with the new CR and how you can program with its APIs. Finally, we'll give an outlook on how we'll make upgrades to the new CR possible.","title":"The Event-Sourced Content Repository for Neos","speakers":[{"name":"Robert Lemke","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/4db8c5a6f9b160ca41875b11c7189e57c70b50ac/RobertLemke-07-2013-square-545x545.jpg","twitter":"robertlemke","company":"Flownative","summary":"Robert Lemke is founder of the Neos Open Source Project and initial creator of the Flow Framework. He's also co-founder and CEO of Flownative, a venture supporting web agencies and organizations to realize successful projects with Neos and Flow. Robert lives in Lübeck, Germany, together with his wife, two daughters, and Rocket, their espresso machine."},{"name":"Sebastian Kurfürst","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/d4b825a8559c795f86085bfe780f48cc1e2791c9/Sebastian-Kurfuerst_300px.jpg","twitter":"skurfuerst","company":"Sandstorm","summary":"Sebastian is a member of the Flow and Neos team almost since its inception. He is most known for his work on Fluid, Extbase and Fusion, but has worked on other parts of the source code as well. As co-founder and CTO at Sandstorm he helps to build relevant solutions for clients, helping them to choose the right frontend and backend technologies. In his free time, you'll most likely find spend time with his wife and son, or you'll see him climbing in the Saxon Switzerland."}],"time":"10:00","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"Congratulations! You finally managed to convince the business that there really is no way to add this important new feature to the old legacy code base without causing major disruptions. But where to go from here? Completely rewriting the old monolithic application that does a gazillion things from scratch may seem tempting but is a gigantic effort with an unforeseeable outcome.\n\nDiscover a way out of legacy hell by learning about architectural patterns as well as concrete technical solutions that enable you to gradually move functionality into new software components without the impediments of a full rewrite.","title":"How to escape Legacy Hell","speakers":[{"name":"Sebastian Heuer","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/7edece30219d974a9f91a78eb251cd150bc36973/sebastian-heuer-foto.1024x1024-545x545.jpg","twitter":"belanur","company":"die kartenmacherei","summary":"Sebastian Heuer plans and writes software for the web since the early 2000s. He focusses on clean software architectures and high-quality, easy to understand code. Apart from his position as Developer Advocate at kartenmacherei.de, he engages in several open-source projects (like https://phar.io) and helps teams to write solid and maintainable software."},{"name":"Arne Blankerts","avatar":"","twitter":"arneblankerts","company":"The PHP Consulting Company","summary":"Arne Blankerts has already dealt with computers when networking was still an adventure. As long-standing head of development of an internet agency, he has created solutions far ahead of the times already years ago. As Co-Founder and Principal Consultant of The PHP Consulting Company (thePHP.cc), Arne helps his clients to develop software successfully. He is author and maintainer of various Open Source development tools, and is a regular presenter at conferences. In his free time he reads fantasy novels and likes to cook."}],"time":"10:50","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"I will show what you can achieve with the multi site feature of Neos based on an actual project with 8+ sites in one Neos instance.\n\nThe more sites you use and the more advanced it gets, the editors might need some advanced features to manage the increasing complexity. The benefit is also there, only one login to manage many sites, only one codebase and one deployment.\n\nNot only will I show what features were added and how the project benefitted from Neos in this case but I will also cover topics like performance, configuration, theming and security aspects which arise in this kind of scenario.","title":"One Neos - Many Websites","speakers":[{"name":"Sebastian Helzle","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/492a0fb671866f55598fd2bc1f5ca6ee2807a1cd/Sebastian-Helzle_300px.jpg","twitter":"sebobo","company":"Punkt.de","summary":"Sebastian fell in love with web development when he was 12 and the road led him to TYPO3 and other great technologies. Now he is focused on Neos CMS as core team member, living Scrum, pushing forward Continuous Integration and leading his team at punkt.de as Product Owner."}],"time":"10:50","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"","title":"Break (15 min)","speakers":[],"time":"11:35","durationInMinutes":45,"room":"Room 1","isBreak":true},{"summary":"","title":"Lightning Talks","speakers":[],"time":"12:00","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"Neos and Flow have been built with distributed storage for assets from the start. Even though most people use a local file storage for their uploaded pictures and documents, there is a lot more to discover which can make your sites more flexible, scalable and powerful.\n\nIn this talk we'll re-visit the resource and asset management in Flow and Neos, see how you can store and publish assets to cloud storages and content delivery networks and finally, how you can seamlessly integrate with external digital asset management tools, using the upcoming Neos 4.0.","title":"Everything about assets","speakers":[{"name":"Robert Lemke","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/4db8c5a6f9b160ca41875b11c7189e57c70b50ac/RobertLemke-07-2013-square-545x545.jpg","twitter":"robertlemke","company":"Flownative","summary":"Robert Lemke is founder of the Neos Open Source Project and initial creator of the Flow Framework. He's also co-founder and CEO of Flownative, a venture supporting web agencies and organizations to realize successful projects with Neos and Flow. Robert lives in Lübeck, Germany, together with his wife, two daughters, and Rocket, their espresso machine."}],"time":"12:50","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"What does leadership in our open source community mean? Do we need role models? What drives us? Who is \"us\"? Why are values so important and why should we validate and communicate them regularly? How can we do this? What is important to keep a decentralized and growing community capable of acting? And how for heaven’s sake do we keep this lean and agile?","title":"Leadersheep","speakers":[{"name":"Gina Steiner","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/1a7f52e7cf8adf9e90077112cfd8c46f560190bb/gina-leak-quadratisch_thumb-756x945-545x681.jpg","twitter":"gina_steiner","company":"sitegeist","summary":"My name is Gina; I was born in 1969 in Black Forest. I’m a Neos team member of the Minions team, the Neos Project is my open source family and I take care of the agile structures, the organizational development and as one of the three directors of the Neos Foundation for the CIC. I work and live in Hamburg, Germany as a Change Manager at sitegeist.\nMy son is 28 years old and I studied Meteorology as a single mom. Already during and after my studies I worked at Max Planck Institute for Meteorology where I got in contact with the open source world. From 2003 on I was highly involved in open source and used to be Vice President of the TYPO3 Association.\nIn private life I’m a GUE cave diver and survey a mine called Nuttlar in Germany. I love travelling the world back and forth since I was 16 and like water sports, swimming and kayaking. I’m a diving instructor, instruct divers free of charge and sail & work on a traditional ship called Windsbraut every year."}],"time":"12:50","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"","title":"Lunch","speakers":[],"time":"13:35","durationInMinutes":45,"room":"Room 1","isBreak":true},{"summary":"A system designed for content creation might not be suited best for publishing and delivering content to the end user.\n\nThe Two-Stack CMS architecture pattern has the idea of using two separate software stacks for editing/creation and publishing/delivery of content. This separation has the great advantage of matching different scalability and security requirements for each stack.\n\nCan Neos be used as a Two-Stack CMS? And what are the implications for the editor and developer? In this talk I will present a production-ready solution using a Redis based content store with different frontend implementations and an outlook for an even more decoupled publishing architecture.","title":"Two-Stack CMS","speakers":[{"name":"Christopher Hlubek","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/a69c8f007bbd5e167d34928512aec35f1a472068/christopher-hlubek_300px.jpg","twitter":"hlubek","company":"networkteam","summary":"Christopher is a Neos team member since 2008. As a CEO / founder of networkteam GmbH (Kiel & Hamburg) he is applying open source approaches into software development for web and mobile applications with various technologies."}],"time":"14:45","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"Neos is a complex product with a multitude of usage scenarios. Setting your project up for success starts at the beginning with the right team setup. I will talk a bit about experiences from teams I worked with, learnings and possible setups. Also drawing from topics gathered while creating the  \"Das Perfekte Team\" podcast.","title":"Your (perfect) Neos team for success","speakers":[{"name":"Christian Müller","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/0045304204160e3f3b75dcb1336ce7ee5655a24c/christian-mueller_300px.jpg","twitter":"daskitsunet","company":"Flownative GmbH","summary":"Christian Müller is co-founder of Flownative, which provides development support, quality assurance, consulting and coaching to Neos and Flow agencies and users. In his free time he picks up the Cello or switches the computer keyboard for a piano keyboard."}],"time":"14:45","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"We want to use practical examples to show and explain the most common Atomic.Fusion and AFX patterns we found during the last two years.\n\nThe first part of the talk will focus on patterns for the visual aspects of a website including AFX and implementing Atomic Design in Fusion. The second part will focus on the integration, showing especially patterns for NodeType definition and the mapping of nodes to presentational components.","title":"Tasty Atomic.Fusion recipes for your website","speakers":[{"name":"Martin Ficzel","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/8ff227766631242daddfd5d96c84db4b55b3fc24/Martin-Ficzel_300px.jpg","twitter":"kopfaufholz","company":"sitegeist","summary":"Martin is a backend developer at sitegeist neos solutions GmbH in Hamburg. \nSince three years he focused his work almost exclusively on Neos and Flow and is still happy with this decision. In 2016 he joined the Neos CMS Core Team where he is working to extend the possibilities of the Neos-Fusion rendering layer. Martin lives in Hamburg with two kids and his girlfriend. Besides work he likes nature and climbing."},{"name":"Wilhelm Behncke","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/2814a1c63260c04d0453822429512cacad81b388/Wilhelm_Behncke_300px.jpg","twitter":"WilhelmBehncke","company":"Sitegeist","summary":"Wilhelm is a cross-stack developer with focus on Neos and Flow at sitegeist neos solutions GmbH in Hamburg. After gaining lots of positive project experiences with Neos in 2015, he joined the core team this year. With his great interest in innovative open source technologies like React JS and Redux, he now supports the project with new solutions in that area. Besides work, he creates music and also enjoys visiting concerts and other events alike."}],"time":"15:35","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"Chatbot applications are only as good as the underlying data they are learning from. Large, complex websites with a lot of content usually rely on navigation techniques that guide users to the information they are looking for. The semantical nature of the content repository, together with a well designed content strategy and the power of artificial intelligence are an excellent foundation to deliver value adding bots that matter. Neos CMS & AI is a strong combination for better user experience.","title":"Hello AI - Using Neos CMS as environment for chatbot applications","speakers":[{"name":"David Spiola","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/1526461719219c142f3c8b59cec0b00358348cb8/David-Spiola_300px.jpg","twitter":"davidspiola","company":"web&co and scrinus","summary":"David Spiola is co-owner and CEO of the web agency web&co (http://webandco.com) and scrinus (http://scrinus.com), a POS SasS product - both located in Vienna Austria. He is totally convinced of Neos and happy to actively use Neos and Flow in both companies. He is the founder of the “Neos and Flow Meetup Group” Vienna and a big fan of the community and people involved. He strongly believes that AI will fundamentally change the way we consume content and that Neos CMS is an excellent choice to deliver it."}],"time":"15:35","durationInMinutes":45,"room":"Room 2","isBreak":false},{"summary":"","title":"Break","speakers":[],"time":"16:20","durationInMinutes":45,"room":"Room 1","isBreak":true},{"summary":"(together with the Neos Team)\n\nThe Neos team discusses some of the latest trends in CMS in a panel. We will be talking about trends such as headless CMS, multichannel content distribution, AI-based services for content management, or static site generators. We'll present out opinions about these and more trends in general and on the influence they have on the future development of Neos.","title":"From the Labs: The Neos Perspective on Current CMS Trends","speakers":[{"name":"Bastian Heist","avatar":"https://storage.googleapis.com/target.instance-a8473874-2f73-4e74-823f-0d235b3cfdbf.euw1.beach.flownative.cloud/6db2737f0ce5f1df4294b378cec78a4f9c2a7acb/Profil_neu_zoomed_veryLowRes-545x545.jpg","twitter":"beheist","company":"Sandstorm","summary":"Bastian Heist is a software architect and project manager at Sandstorm in Darmstadt, where he creates awesome web applications - preferably with Neos. Since 2017, he is a member of the Neos core team. Apart from his work at Sandstorm, he writes about web technology and runs the Neos Meetup Rhein/Main."}],"time":"16:45","durationInMinutes":45,"room":"Room 1","isBreak":false},{"summary":"","title":"Closing of day 2","speakers":[],"time":"17:30","durationInMinutes":45,"room":"Room 1","isBreak":false}]]