[[{"summary":"","title":"Registration + breakfast snacks","speakers":[],"time":"09:00","room":"Room 1","isBreak":false},{"summary":"","title":"Conference Opening","speakers":[],"time":"10:00","room":"Room 1","isBreak":false},{"summary":"","title":"Welcome Keynote (incl. Neos Foundation)","speakers":[],"time":"10:30","room":"Room 1","isBreak":false},{"summary":"","title":"Break","speakers":[],"time":"11:15","room":"Room 1","isBreak":true},{"summary":"","title":"The F-Files - Insights from 3 years of Neos Support","speakers":[],"time":"11:45","room":"Room 1","isBreak":false},{"summary":"No more waste: no offers, no specs, no contracts and your projects will be better, faster, cheaper. Forget old school and waterfall: Do projects the most efficient way you can imagine.    During the agile transition of its company, sitegeist combined L.ean and A.gile components with R.aw E.stimates. Without knowing, they created a disruptive new agency concept.   Get the main idea of „#RawEstimates“ and „The RE.A.L.-Concept“ with practical examples, take a look on how to establish and control it.   At first sitegeist was asked proactively to coach and consult a radical “agilisation” by various internet- and marketing agencies. Meanwhile sitegeist advises other international consultants and production-businesses on becoming agile.   It can be a real game-changer for your agency.   More Information: https://real.sitegeist.rocks/ This topic with this speaker was already voted several times for the best talk of conferences and barcamps.","title":"Do the RE.A.L Thing: No-Waste-Projects","speakers":[],"time":"11:45","room":"Room 2","isBreak":false},{"summary":"(together with Max Strübing)New user interface of the Neos CMS is not merely a rewrite of the old functionality, being based on ReactJS it unveils an exciting topic of extensibility which goes way beyond what has yet been possible with the old UI. In this talk we will demonstrate all of the basic points of planned extensibility, but won't stop there and show you how it is possible to build completely custom-tailored interfaces for your projects without spending NASA-like budgets.","title":"Neos UI Extensibility and Beyond","speakers":[],"time":"12:35","room":"Room 1","isBreak":false},{"summary":"In this talk, you will see why it is fantastic to publish packages, which are the challenges, and why it is important to publish your code for Neos. Also, some tips and tricks will be delivered: How it create an easy-to-install but yet powerful to customize and expandable package. In the end, you will be encouraged to create and maintain your own packages.","title":"Why creating Open Source packages help you to become a better developer","speakers":[],"time":"12:35","room":"Room 2","isBreak":false},{"summary":"","title":"Lunch","speakers":[],"time":"13:20","room":"Room 1","isBreak":true},{"summary":"There are many ways to start a new Neos-based project and there is a multitude of tools involved. This session will introduce a \"perfect\" way to set up a Neos project. It covers the versioning in Git, offering a setup that allows to manage multiple packages in one repository without affecting how dependencies are managed with composer. A way to and maintain a consistent local development environment to minimize ramp-up time and allow developers to quickly get started with a project will be shown.  Deployment and hosting strategies along with suggestions to use configuration contexts to keep settings organized and conflict-free will  close the session.","title":"The perfect Neos project setup","speakers":[],"time":"14:30","room":"Room 1","isBreak":false},{"summary":"This talk explains the principles of every system that is exposed to variability and unpredictability. Such as software development. Learn why it is not capacity planning that will save your day, what traffic and stock markets can tell you about your organization, what is the key benefit of agile practices and how you might be wasting your company’s potential. Find out the correct economics to base your decisions on. Change your system - not your people.","title":"Buried in queues","speakers":[],"time":"14:30","room":"Room 2","isBreak":false},{"summary":"","title":"Case Studies\n\n\t\t\t\n\t\t\t\tA sightseeing flight over the scientific publishing world based on Neos Flow\n\t\t\t\tManage Neos and Flow in a Kubernetes cluster","speakers":[],"time":"15:20","room":"Room 1","isBreak":false},{"summary":"","title":"Coffee Break","speakers":[],"time":"16:05","room":"Room 1","isBreak":true},{"summary":"","title":"Fusion Best Practices","speakers":[],"time":"16:30","room":"Room 1","isBreak":false},{"summary":"How agencies use open source software, advantages and disadvantages, why agencies should contribute to open source, the benefits.","title":"How agencies profit from Open Source","speakers":[],"time":"16:30","room":"Room 2","isBreak":false},{"summary":"","title":"Neos Award + Closing Day 1","speakers":[],"time":"17:20","room":"Room 1","isBreak":false},{"summary":"","title":"Social Event - Drinks, Snacks & Dancing","speakers":[],"time":"20:00","room":"Room 1","isBreak":false}],[{"summary":"","title":"Arrival & Breakfast","speakers":[],"time":"09:00","room":"Room 1","isBreak":true},{"summary":"","title":"Benefits of an Event-Sourced Content Repository for Neos","speakers":[],"time":"10:00","room":"Room 1","isBreak":false},{"summary":"(together with Sebastian Kurfürst)","title":"Interacting and using the Event-Sourced Content Repository for Neos","speakers":[],"time":"10:50","room":"Room 1","isBreak":false},{"summary":"","title":"One Neos - Many Websites","speakers":[],"time":"10:50","room":"Room 2","isBreak":false},{"summary":"","title":"Break (15 min)","speakers":[],"time":"11:35","room":"Room 1","isBreak":true},{"summary":"","title":"Lightning Talks","speakers":[],"time":"12:00","room":"Room 1","isBreak":false},{"summary":"How resource management in Flow and Neos works from small to big scale, how to get assets in and out, cloud and not cloud, integrating external systems (DAMs, shops, ...)","title":"Everything about assets","speakers":[],"time":"12:50","room":"Room 1","isBreak":false},{"summary":"What does leadership in our open source community mean? Do we need role models? What drives us? Who is \"us\"? Why are values so important and why should we validate and communicate them regularly? How can we do this? What is important to keep a decentralized and growing community capable of acting? And how for heaven’s sake do we keep this lean and agile?","title":"Leadersheep","speakers":[],"time":"12:50","room":"Room 2","isBreak":false},{"summary":"","title":"Lunch","speakers":[],"time":"13:35","room":"Room 1","isBreak":true},{"summary":"","title":"Two-Stack CMS","speakers":[],"time":"14:45","room":"Room 1","isBreak":false},{"summary":"Neos is a complex product with a multitude of usage scenarios. Setting your project up for success starts at the beginning with the right team setup. I will talk a bit about experiences from teams I worked with, learnings and possible setups. Also drawing from topics gathered while creating the  \"Das Perfekte Team\" podcast.","title":"Your (perfect) Neos team for success","speakers":[],"time":"14:45","room":"Room 2","isBreak":false},{"summary":"(together with Martin Ficzel)Sometimes, you open up a website and before anything else these buttons appear: “To the website” or “To the shop”. Why is this necessary? Most likely, because shopping solutions usually lack CMS-like editing powers and CMSs usually lack features like checkout, stock, orders and customer data. An integrated experience requires you to choose one system and add the missing features. Or is it possible to marry the best of both worlds? We will show the example of an integration between Shopware and Neos and our approach to problems like Handling article data without redundancy Synchronizing the content cache with Shopware Bridging the gap between the two rendering layers Managing routes between both systems Augmenting article data with custom content","title":"Building Content-driven Shopping Experiences with Neos & Shopware","speakers":[],"time":"15:35","room":"Room 1","isBreak":false},{"summary":"Chatbot applications are only as good as the underlying data they are learning from. Large, complex websites with a lot of content, rely on navigation techniques, that guide users to the information they are looking for. The semantical nature of the content repository, together with a well designed content strategy and the power of artificial intelligence are an excellent foundation to deliver value adding bots that matter. Neos CMS & AI is a strong combination for better user experience.","title":"Hello AI - Using Neos CMS as environment for chatbot applications","speakers":[],"time":"15:35","room":"Room 2","isBreak":false},{"summary":"","title":"Break","speakers":[],"time":"16:20","room":"Room 1","isBreak":true},{"summary":"","title":"From the Labs: Evolving the Neos UI with Structured Editing","speakers":[],"time":"16:45","room":"Room 1","isBreak":false},{"summary":"","title":"Closing of day 2","speakers":[],"time":"17:30","room":"Room 1","isBreak":false}]]